app/controllers/requests_controller.rb

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
	def show
		@request = Request.find(params[:id])

INSERT INTO "requests" ("user_action", "level", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_action", "Add"], ["level", "Reporter"], ["created_at", 2016-10-17 23:56:26 UTC], ["updated_at", 2016-10-17 23:56:26 UTC]]
---
	def create
    	@request = Request.new(request_params)

    	if @request.save

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
	def destroy
    	@request = Request.find(params[:id])